{
  "school": [
    {
      "title": "Værstasjon",
      "media": "<img src=\"../../assets/images/verstasjon.jpg\" alt=\"bildet\" class=\"img\" loading=\"lazy\">",
      "date": "26.04.21",
      "text": "Verstasjonen handlet om å samle inn værdata, plassere inn i database og hente fra databasen og plasserer på nettside. Vi brukte MySQL database og PHP til å få det inn i database og nettside. En annen del av oppgaven var at vi skulle programmere et system med Python som overvåkte et rom og detektet om det kom noen inn, idéen var og lage rammeverket for et system der man kunne sjekke om et rom var ledig."
    },
    {
      "title": "App",
      "media": "<img src=\"../../assets/images/app.jpg\" alt=\"bildet\" class=\"img\" loading=\"lazy\">",
      "date": "13.04.21",
      "text": "Dette prosjektet handlet om at vi skulle lage en demo app for en kunde. Våres gruppe valgte Kaffe Diem som vår kunde og vi lagde en demo app og web interface. Vi var tre stykker på gruppen, med en gigantisk idè på hva vi ville få til. Vi endte opp med og spørre læreren om ekstra tid (som vi fikk ja til) og planlagte et ekstremt vanskelig og tidkrevende prosjekt for kompetansen vår. Planen innebærte notifikasjoner etter oppdatering i database, oppdatering av passsord hver uke, dynamisk app der de som jobbet i Kaffe Diem kunne legge in nye ting på menyen uten at ting skulle være vanskelig."
    },
    {
      "title": "Raspberry Pi",
      "media": "<img src=\"../../assets/images/rpi.jpg\" alt=\"bildet\" class=\"img\" loading=\"lazy\">",
      "date": "26.03.21",
      "text": "I denne oppgaven brukte vi Raspberry PI (RPI) og vi fikk som oppgave å starte hvilket som helst prosjekt vi ville så lenge vi viste kompetanse. Min gruppe sitt prosjekt gikk ut på å: 1. Trykke på en knapp, 2. Starte en nedtelling med lys, 3. Ta bilde da timeren er ferdig. Det var et simpelt prosjekt men det holdt oss opptatt og det var lærerikt."
    },
    {
      "title": "Database",
      "media": "<iframe src=\"https://www.youtube.com/embed/_Z-V9e34ddo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen loading=\"lazy\"></iframe>",
      "date": "25.02.21",
      "text": "Videoen handler om et prosjekt som gikk ut på å lagre informasjon om fagkilder i en database. Et annet krav var og koble til nettside på dette og gjøre det mulig og set fagkildene på nettsiden. Det var og mulig og sette inn fagkildene på nettsiden. Dataen var dynamisk lastet inn med PHP inn i en tabell på nettsiden der dataen var lett og forståelig og lese."
    },
    {
      "title": "Videodagbok",
      "media": "<iframe src=\"https://www.youtube.com/embed/h1NaiH2hyCs\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen loading=\"lazy\"></iframe>",
      "date": "11.01.21",
      "text": "Videoprosjektet gikk ut på å lage et innlegg til en videodagbok. Videoen skulle forsøke å vise hvordan en vanlig dag under korona var, og hvordan det kanskje har påvirket livet mitt. Jeg filmet en hel uke og satte det sammen for å vise en slags helhet i hverdagene. Jeg ville vise hvordan livet er veldig repitivt og hvordan det egentlig ikke har endret seg så mye etter korona."
    },
    {
      "title": "Lego",
      "media": "<iframe src=\"https://www.youtube.com/embed/HxwR7FIav68\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen loading=\"lazy\"></iframe>",
      "date": "05.01.21",
      "text": "Vi lagde en lego robot som kunne kjøre i mange alle retninger og utføre alle slags mulige ting. Vi startet med å bygge lego med fire stykker på gruppen. Oppgaven gikk hovedsakelig ut på blokkprogrammering, testing og utforsking. Vi fikk et par utfordringer vi skulle løse også fikk vi muligheten til og lage akkurat hva vi ville, sånn at vi kunne vise ekstra kompetanse."
    },
    {
      "title": "Charity",
      "media": "<img src=\"../../assets/images/charity.jpg\" alt=\"bildet av en xbox kontroller\" class=\"img\" loading=\"lazy\">",
      "date": "17.12.20",
      "text": "Denne gang hadde vi et tverrfaglig prosjekt som gikk ut på å samle penger inn til veldedighet. Vi samlet inn til BCFS som en del av skolens årlige innsamlingsaksjon. Siden klassen vår er en IT og media klasse valgte vi og ha en stream. Vi spilte masse spill og hadde masse flotte utfordringer med kommentatorer og alt mulig. Vi streamet totalt 9 timer og samlet inn rett rundt 17 000 kr. Jeg synes det var veldig gøy og streamen ble en stor suksess. <a href=\"https://docs.google.com/document/d/1foxj9DL2PIXq5AzErvu6ryT_5wtbNj7TR9es8mGa4bM/edit?usp=sharing\" target=\"_blank\" class=\"sections-btn subjectbtn\">Mer</a>"
    },
    {
      "title": "Reklame",
      "media": "<iframe src=\"https://www.youtube.com/embed/W7IoIeMsydU\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen loading=\"lazy\"></iframe>",
      "date": "17.11.20",
      "text": "Oppgaven gikk ut på å lage en reklamefilm for linjen, dette var et delvis gruppeprosjekt. Vi filmet sammen i grupper men måtte redigere hver for oss, for å eliminere problemet med at noen gjør alt. Vi var tre på gruppen og vi gikk for en reklamefilm som viste en vanlig dag på skolen. <a href=\"#\" target=\"_blank\" class=\"sections-btn subjectbtn\">Mer</a>"
    },
    {
      "title": "Fotoserie",
      "media": "<img src=\"../../assets/images/photoserie.jpg\" alt=\"Bilde\" class=\"img\" loading=\"lazy\">",
      "date": "04.11.20",
      "text": "Fotoserien handlet om å lage en historie på fire bilder, men historien skulle og kunnes sett fra flere vinkler. Dvs. en vei er det en konklusjon (en mann dør) og hvis man endrer rekkefølgen på bildene så kommer man til en annen konlusjon (en man dør ikke). Dette var en av fire bilder tilhørende oppgaven min. <a href=\"https://docs.google.com/presentation/d/1BPuJTTA9PDIgeSSA2F_VkkZ4hgttO9kGwgVUXOCcWt8/edit?usp=sharing\" target=\"_blank\" class=\"sections-btn subjectbtn\">Mer</a>"
    },
    {
      "title": "HMS",
      "media": "<img src=\"../../assets/images/hms.JPG\" alt=\"Bilde\" class=\"img\" loading=\"lazy\">",
      "date": "20.10.20",
      "text": "Prosjektet gikk ut på å lære om HMS, GDPR og andre sikkehets foreskrifter. Jeg hadde om HMS og lagde denne presentasjonen angående dette. HMS står for helse, miljø og sikkerhet og handler om arbeidet man gjør for å forbedre arbeidsplassen. <a href=\"https://docs.google.com/presentation/d/1946PR6z7mhGwhbbER3RiiGJjzL5NFr66d76q4pIAmOM/edit?usp=sharing\" target=\"_blank\" class=\"sections-btn subjectbtn\">Mer</a>"
    }
  ]
}